apache/nuttx/arch/arm/src/stm32l4/stm32l4_rtcc.c
  (void)stm32l4_pwr_enablebkp(true);

  /* Check for EXTI from Alarm A or B and handle according */

  cr  = getreg32(STM32L4_RTC_CR);
  if ((cr & RTC_CR_ALRAIE) != 0)
    {
      isr  = getreg32(STM32L4_RTC_ISR);
      if ((isr & RTC_ISR_ALRAF) != 0)
        {
          cbinfo = &g_alarmcb[RTC_ALARMA];
          if (cbinfo->ac_cb != NULL)
            {
              /* Alarm A callback */

              cb  = cbinfo->ac_cb;
              arg = (FAR void *)cbinfo->ac_arg;

              cbinfo->ac_cb  = NULL;
              cbinfo->ac_arg = NULL;

              cb(arg, RTC_ALARMA);
            }

          /* note, bits 8-13 do /not/ require the write enable procedure */

          isr  = getreg32(STM32L4_RTC_ISR);
          isr &= ~RTC_ISR_ALRAF;
          putreg32(isr, STM32L4_RTC_ISR);
        }
    }

  cr  = getreg32(STM32L4_RTC_CR);
  if ((cr & RTC_CR_ALRBIE) != 0)
    {
      isr  = getreg32(STM32L4_RTC_ISR);
      if ((isr & RTC_ISR_ALRBF) != 0)
        {
          cbinfo = &g_alarmcb[RTC_ALARMB];
          if (cbinfo->ac_cb != NULL)
            {
              /* Alarm B callback */

              cb  = cbinfo->ac_cb;
              arg = (FAR void *)cbinfo->ac_arg;

              cbinfo->ac_cb  = NULL;
              cbinfo->ac_arg = NULL;

              cb(arg, RTC_ALARMB);
            }

          /* note, bits 8-13 do /not/ require the write enable procedure */

          isr  = getreg32(STM32L4_RTC_ISR);
          isr &= ~RTC_ISR_ALRBF;
          putreg32(isr, STM32L4_RTC_ISR);
        }
    }

  /* Disable write access to the backup domain (RTC registers, RTC backup
   * data registers and backup SRAM).
   */

  (void)stm32l4_pwr_enablebkp(false);

  return ret;
}
#endif

/************************************************************************************
 * Name: rtchw_check_alrXwf X= a or B
 *
 * Description:
 *   Check registers
 *
 * Input Parameters:
 * None
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno on failure
 *
 ************************************************************************************/

#ifdef CONFIG_RTC_ALARM
static int rtchw_check_alrawf(void)
{
  volatile uint32_t timeout;
  uint32_t regval;
  int ret = -ETIMEDOUT;

  /* Check RTC_ISR ALRAWF for access to alarm register,
   * Can take 2 RTCCLK cycles or timeout
   * CubeMX use GetTick.
   */

  for (timeout = 0; timeout < INITMODE_TIMEOUT; timeout++)
    {
      regval = getreg32(STM32L4_RTC_ISR);
      if ((regval & RTC_ISR_ALRAWF) != 0)
        {
          ret = OK;
          break;
        }
    }

  return ret;
}
#endif

#ifdef CONFIG_RTC_ALARM
static int rtchw_check_alrbwf(void)
{
  volatile uint32_t timeout;
  uint32_t regval;
  int ret = -ETIMEDOUT;

  /* Check RTC_ISR ALRAWF for access to alarm register,
   * can take 2 RTCCLK cycles or timeout
   * CubeMX use GetTick.
   */

  for (timeout = 0; timeout < INITMODE_TIMEOUT; timeout++)
    {
      regval = getreg32(STM32L4_RTC_ISR);
      if ((regval & RTC_ISR_ALRBWF) != 0)
        {
          ret = OK;
          break;
        }
    }

  return ret;
}
#endif

/************************************************************************************
 * Name: stm32l4_rtchw_set_alrmXr X is a or b
 *
 * Description:
 *   Set the alarm (A or B) hardware registers, using the required hardware access
 *   protocol
 *
 * Input Parameters:
 *   alarmreg - the register
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno on failure
 *
 ************************************************************************************/

#ifdef CONFIG_RTC_ALARM
static int rtchw_set_alrmar(rtc_alarmreg_t alarmreg)
{
  int isr;
  int ret = -EBUSY;

  /* Need to allow RTC register write
   * Disable the write protection for RTC registers
   */

  rtc_wprunlock();

  /* Disable RTC alarm A & Interrupt A */

  modifyreg32(STM32L4_RTC_CR, (RTC_CR_ALRAE | RTC_CR_ALRAIE), 0);

  /* Ensure Alarm A flag reset; this is edge triggered */

  isr  = getreg32(STM32L4_RTC_ISR) & ~RTC_ISR_ALRAF;
  putreg32(isr, STM32L4_RTC_ISR);

  /* Wait for Alarm A to be writable */

  ret = rtchw_check_alrawf();
  if (ret != OK)
    {
      goto errout_with_wprunlock;
    }

  /* Set the RTC Alarm A register */

  putreg32(alarmreg, STM32L4_RTC_ALRMAR);
  putreg32(0, STM32L4_RTC_ALRMASSR);
  rtcinfo("  TR: %08x ALRMAR: %08x\n",
          getreg32(STM32L4_RTC_TR), getreg32(STM32L4_RTC_ALRMAR));

  /* Enable RTC alarm A */

  modifyreg32(STM32L4_RTC_CR, 0, (RTC_CR_ALRAE | RTC_CR_ALRAIE));

errout_with_wprunlock:
  rtc_wprlock();
  return ret;
}
#endif

#ifdef CONFIG_RTC_ALARM
static int rtchw_set_alrmbr(rtc_alarmreg_t alarmreg)
{
  int isr;
  int ret = -EBUSY;

  /* Need to allow RTC register write
   * Disable the write protection for RTC registers
   */

  rtc_wprunlock();

  /* Disable RTC alarm B & Interrupt B */

  modifyreg32(STM32L4_RTC_CR, (RTC_CR_ALRBE | RTC_CR_ALRBIE), 0);

  /* Ensure Alarm B flag reset; this is edge triggered */

  isr  = getreg32(STM32L4_RTC_ISR) & ~RTC_ISR_ALRBF;
  putreg32(isr, STM32L4_RTC_ISR);

  /* Wait for Alarm B to be writable */

  ret = rtchw_check_alrbwf();
  if (ret != OK)
    {
      goto rtchw_set_alrmbr_exit;
    }

  /* Set the RTC Alarm B register */

  putreg32(alarmreg, STM32L4_RTC_ALRMBR);
  putreg32(0, STM32L4_RTC_ALRMBSSR);
  rtcinfo("  TR: %08x ALRMBR: %08x\n",
          getreg32(STM32L4_RTC_TR), getreg32(STM32L4_RTC_ALRMBR));

  /* Enable RTC alarm B */

  modifyreg32(STM32L4_RTC_CR, 0, (RTC_CR_ALRBE | RTC_CR_ALRBIE));

rtchw_set_alrmbr_exit:
  rtc_wprlock();
  return ret;
}
#endif

/****************************************************************************
 * Name: rtc_enable_alarm
 *
 * Description:
 *   Enable ALARM interrupts
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_RTC_ALARM
static inline void rtc_enable_alarm(void)
{
  /* Is the alarm already enabled? */

  if (!g_alarm_enabled)
    {
      /* Configure RTC interrupt to catch alarm interrupts. All RTC
       * interrupts are connected to the EXTI controller.  To enable the
       * RTC Alarm interrupt, the following sequence is required:
       *
       * 1. Configure and enable the EXTI Line 18 in interrupt mode and
       *    select the rising edge sensitivity.
       *    EXTI line 19 RTC Tamper or Timestamp or CSS_LSE
       *    EXTI line 20 RTC Wakeup
       * 2. Configure and enable the RTC_Alarm IRQ channel in the NVIC.
       * 3. Configure the RTC to generate RTC alarms (Alarm A or Alarm B).
       */

      (void)stm32l4_exti_alarm(true, false, true, stm32l4_rtc_alarm_handler, NULL);
      g_alarm_enabled = true;
    }
}
#endif

/************************************************************************************
 * Public Functions
 ************************************************************************************/

/************************************************************************************
 * Name: stm32l4_rtc_is_initialized
 *
 * Description:
 *    Returns 'true' if the RTC has been initialized (according to the RTC itself).
 *    It will be 'false' if the RTC has never been initialized since first time power
 *    up, and the counters are stopped until it is first initialized.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   bool -- true if the INITS flag is set in the ISR.
 *
 ************************************************************************************/

bool stm32l4_rtc_is_initialized(void)
{
  uint32_t regval;

  regval = getreg32(STM32L4_RTC_ISR);

  return (regval & RTC_ISR_INITS) ? true : false;
}

/************************************************************************************
 * Name: up_rtc_initialize
 *
 * Description:
 *   Initialize the hardware RTC per the selected configuration.  This function is
 *   called once during the OS initialization sequence
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno on failure
 *
 ************************************************************************************/

int up_rtc_initialize(void)
{
  bool init_stat;
  uint32_t regval;
  int ret;

