apache/nuttx/arch/arm/src/stm32l4/stm32l4_rtcc.c
  rtc_dumpregs("Before Initialization");

  /* See if the clock has already been initialized; since it is battery
   * backed, we don't need or want to re-initialize on each reset.
   */

  init_stat = stm32l4_rtc_is_initialized();
  if (!init_stat)
    {
      /* Enable write access to the backup domain (RTC registers, RTC
       * backup data registers and backup SRAM).
       */

      (void)stm32l4_pwr_enablebkp(true);

#if defined(CONFIG_STM32L4_RTC_HSECLOCK)
      modifyreg32(STM32L4_RCC_BDCR, RCC_BDCR_RTCSEL_MASK, RCC_BDCR_RTCSEL_HSE);
#elif defined(CONFIG_STM32L4_RTC_LSICLOCK)
      modifyreg32(STM32L4_RCC_BDCR, RCC_BDCR_RTCSEL_MASK, RCC_BDCR_RTCSEL_LSI);
#elif defined(CONFIG_STM32L4_RTC_LSECLOCK)
      modifyreg32(STM32L4_RCC_BDCR, RCC_BDCR_RTCSEL_MASK, RCC_BDCR_RTCSEL_LSE);
#endif

      /* Enable the RTC Clock by setting the RTCEN bit in the RCC register */

      modifyreg32(STM32L4_RCC_BDCR, 0, RCC_BDCR_RTCEN);

      /* Disable the write protection for RTC registers */

      rtc_wprunlock();

      /* Set Initialization mode */

      if (OK != rtc_enterinit())
        {
          /* Enable the write protection for RTC registers */

          rtc_wprlock();

          /* Disable write access to the backup domain (RTC registers, RTC backup
           * data registers and backup SRAM).
           */

          (void)stm32l4_pwr_enablebkp(false);

          rtc_dumpregs("After Failed Initialization");

          return -1;
        }
      else
        {
          /* Clear RTC_CR FMT, OSEL and POL Bits */

          regval = getreg32(STM32L4_RTC_CR);
          regval &= ~(RTC_CR_FMT | RTC_CR_OSEL_MASK | RTC_CR_POL);

          /* Configure RTC pre-scaler with the required values */

#ifdef CONFIG_STM32L4_RTC_HSECLOCK
          /* The HSE is divided by 32 prior to the prescaler we set here.
           * 1953
           * NOTE: max HSE/32 is 4 MHz if it is to be used with RTC
           */

          /* For a 1 MHz clock this yields 0.9999360041 Hz on the second
           * timer - which is pretty close.
           */

          putreg32(((uint32_t)7812 << RTC_PRER_PREDIV_S_SHIFT) |
                  ((uint32_t)0x7f << RTC_PRER_PREDIV_A_SHIFT),
                  STM32L4_RTC_PRER);
#elif defined(CONFIG_STM32L4_RTC_LSICLOCK)
          /* Suitable values for 32.000 KHz LSI clock (29.5 - 34 KHz, though) */

          putreg32(((uint32_t)0xf9 << RTC_PRER_PREDIV_S_SHIFT) |
                  ((uint32_t)0x7f << RTC_PRER_PREDIV_A_SHIFT),
                  STM32L4_RTC_PRER);
#else /* defined(CONFIG_STM32L4_RTC_LSECLOCK) */
          /* Correct values for 32.768 KHz LSE clock */

          putreg32(((uint32_t)0xff << RTC_PRER_PREDIV_S_SHIFT) |
                  ((uint32_t)0x7f << RTC_PRER_PREDIV_A_SHIFT),
                  STM32L4_RTC_PRER);
#endif

          /* Wait for the RTC Time and Date registers to be synchronized with RTC APB
           * clock.
           */

          ret = rtc_synchwait();
          (void)ret;

          /* Exit Initialization mode */

          rtc_exitinit();

          /* Enable the write protection for RTC registers */

          rtc_wprlock();

          /* Disable write access to the backup domain (RTC registers, RTC backup
           * data registers and backup SRAM).
           */

          (void)stm32l4_pwr_enablebkp(false);
        }
    }
  else
    {
      /* Enable write access to the backup domain (RTC registers, RTC
       * backup data registers and backup SRAM).
       */

      (void)stm32l4_pwr_enablebkp(true);

      /* Disable the write protection for RTC registers */

      //rtc_wprunlock();

      rtc_resume();

      /* Enable the write protection for RTC registers */

      //rtc_wprlock();

      /* Disable write access to the backup domain (RTC registers, RTC backup
       * data registers and backup SRAM).
       */

      (void)stm32l4_pwr_enablebkp(false);
    }

  g_rtc_enabled = true;
  rtc_dumpregs("After Initialization");

  return OK;
}

/************************************************************************************
 * Name: stm32_rtc_irqinitialize
 *
 * Description:
 *   Initialize IRQs for RTC, not possible during up_rtc_initialize because
 *   up_irqinitialize is called later.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno on failure
 *
 ************************************************************************************/

int stm32_rtc_irqinitialize(void)
{
  /* Nothing to do */

  return OK;
}

/************************************************************************************
 * Name: stm32l4_rtc_getdatetime_with_subseconds
 *
 * Description:
 *   Get the current date and time from the date/time RTC.  This interface
 *   is only supported by the date/time RTC hardware implementation.
 *   It is used to replace the system timer.  It is only used by the RTOS during
 *   initialization to set up the system time when CONFIG_RTC and CONFIG_RTC_DATETIME
 *   are selected.
 *
 *   Sub-second accuracy is returned through 'nsec'.
 *
 * Input Parameters:
 *   tp - The location to return the high resolution time value.
 *   nsec - The location to return the subsecond time value.
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno on failure
 *
 ************************************************************************************/

int stm32l4_rtc_getdatetime_with_subseconds(FAR struct tm *tp, FAR long *nsec)
{
  uint32_t ssr;
  uint32_t dr;
  uint32_t tr;
  uint32_t tmp;

  /* Sample the data time registers.  There is a race condition here... If we sample
   * the time just before midnight on December 31, the date could be wrong because
   * the day rolled over while were sampling.
   */

  do
    {
      dr  = getreg32(STM32L4_RTC_DR);
      tr  = getreg32(STM32L4_RTC_TR);
      ssr = getreg32(STM32L4_RTC_SSR);
      tmp = getreg32(STM32L4_RTC_DR);
    }
  while (tmp != dr);

  rtc_dumpregs("Reading Time");

  /* Convert the RTC time to fields in struct tm format.  All of the STM32
   * All of the ranges of values correspond between struct tm and the time
   * register.
   */

  tmp = (tr & (RTC_TR_SU_MASK | RTC_TR_ST_MASK)) >> RTC_TR_SU_SHIFT;
  tp->tm_sec = rtc_bcd2bin(tmp);

  tmp = (tr & (RTC_TR_MNU_MASK | RTC_TR_MNT_MASK)) >> RTC_TR_MNU_SHIFT;
  tp->tm_min = rtc_bcd2bin(tmp);

  tmp = (tr & (RTC_TR_HU_MASK | RTC_TR_HT_MASK)) >> RTC_TR_HU_SHIFT;
  tp->tm_hour = rtc_bcd2bin(tmp);

  /* Now convert the RTC date to fields in struct tm format:
   * Days: 1-31 match in both cases.
   * Month: STM32 is 1-12, struct tm is 0-11.
   * Years: STM32 is 00-99, struct tm is years since 1900.
   * WeekDay: STM32 is 1 = Mon - 7 = Sun
   *
   * Issue:  I am not sure what the STM32 years mean.  Are these the
   * years 2000-2099?  I'll assume so.
   */

